Revit 2027 API
FilteredElementCollector.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<Element> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of Element)
public:
virtual IEnumerator<Element^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<Element>
override GetEnumerator : unit -> IEnumerator<Element>
Return Value
IEnumerator<Element>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace